In [2]:
import pandas as pd

In [9]:
df1 = pd.read_csv(r'transactions_2024-07-23.csv')
df2 = pd.read_csv(r'transactions_2024-07-24.csv')
df3 = pd.read_csv(r'transactions_2024-07-25.csv')

In [10]:
udf = pd.concat([df1,df2,df3])

In [11]:
udf

,customer_id,name,debit_card_number,debit_card_type,bank_name,transaction_date,amount_spend
0,1001,Ravi Kumar,1234567890123456,Visa,State Bank of India,2024-07-23,26.85
1,1002,Anjali Gupta,2345678901234567,Mastercard,HDFC Bank,2024-07-23,317.38
2,1003,Rahul Singh,3456789012345678,American Express,ICICI Bank,2024-07-23,217.62
3,1004,Priya Sharma,4567890123456789,Discover,Axis Bank,2024-07-23,78.52
4,1005,Suresh Patel,5678901234567890,Visa,Kotak Mahindra Bank,2024-07-23,107.69
...,...,...,...,...,...,...,...
395,1016,Meera Singh,6789012345678901,Discover,Andhra Bank,2024-07-25,459.93
396,1017,Arjun Gupta,7890123456789012,Visa,Canara Bank,2024-07-25,57.95
397,1018,Anushka Sharma,8901234567890123,Mastercard,Axis Bank,2024-07-25,60.99
398,1019,Aryan Khan,9012345678901234,American Express,Yes Bank,2024-07-25,412.52
399,1020,Deepika Patel,123456789012345,Discover,HDFC Bank,2024-07-25,486.34

In [12]:
udf.groupby(['customer_id','debit_card_number','bank_name'])['amount_spend'].sum()

customer_id  debit_card_number  bank_name
1001         1234567890123456   State Bank of India     14041.34
1002         2345678901234567   HDFC Bank               15481.03
1003         3456789012345678   ICICI Bank              14939.28
1004         4567890123456789   Axis Bank               14560.52
1005         5678901234567890   Kotak Mahindra Bank     14529.96
1006         6789012345678901   IndusInd Bank           17135.07
1007         7890123456789012   Yes Bank                16359.34
1008         8901234567890123   Punjab National Bank    12791.57
1009         9012345678901234   Bank of Baroda          16598.95
1010         123456789012345    Canara Bank             15226.56
1011         1234567890123456   Union Bank of India     16322.83
1012         2345678901234567   Bank of India           17536.62
1013         3456789012345678   Indian Bank             15456.21
1014         4567890123456789   Bank of Maharashtra     14982.68
1015         5678901234567890   Allahabad Bank          16752.05
1016         6789012345678901   Andhra Bank             15964.45
1017         7890123456789012   Canara Bank             15321.82
1018         8901234567890123   Axis Bank               14353.31
1019         9012345678901234   Yes Bank                16764.89
1020         123456789012345    HDFC Bank               15127.21
Name: amount_spend, dtype: float64

In [7]:
df1.groupby(['customer_id','debit_card_number','bank_name'])['amount_spend'].sum()

customer_id  debit_card_number  bank_name
1001         1234567890123456   State Bank of India     4751.90
1002         2345678901234567   HDFC Bank               5538.02
1003         3456789012345678   ICICI Bank              5265.00
1004         4567890123456789   Axis Bank               4908.77
1005         5678901234567890   Kotak Mahindra Bank     4571.79
1006         6789012345678901   IndusInd Bank           6346.91
1007         7890123456789012   Yes Bank                5108.10
1008         8901234567890123   Punjab National Bank    4806.56
1009         9012345678901234   Bank of Baroda          5428.66
1010         123456789012345    Canara Bank             4749.35
1011         1234567890123456   Union Bank of India     5988.16
1012         2345678901234567   Bank of India           4725.01
1013         3456789012345678   Indian Bank             5686.75
1014         4567890123456789   Bank of Maharashtra     4730.34
1015         5678901234567890   Allahabad Bank          5327.32
1016         6789012345678901   Andhra Bank             4860.45
1017         7890123456789012   Canara Bank             4576.67
1018         8901234567890123   Axis Bank               5212.04
1019         9012345678901234   Yes Bank                4477.39
1020         123456789012345    HDFC Bank               4400.71
Name: amount_spend, dtype: float64

In [8]:
df2.groupby(['customer_id','debit_card_number','bank_name'])['amount_spend'].sum()

customer_id  debit_card_number  bank_name
1001         1234567890123456   State Bank of India     4304.82
1002         2345678901234567   HDFC Bank               5383.62
1003         3456789012345678   ICICI Bank              4939.64
1004         4567890123456789   Axis Bank               4614.28
1005         5678901234567890   Kotak Mahindra Bank     4774.26
1006         6789012345678901   IndusInd Bank           5404.26
1007         7890123456789012   Yes Bank                5041.64
1008         8901234567890123   Punjab National Bank    2617.44
1009         9012345678901234   Bank of Baroda          5711.56
1010         123456789012345    Canara Bank             4864.87
1011         1234567890123456   Union Bank of India     5186.10
1012         2345678901234567   Bank of India           6131.45
1013         3456789012345678   Indian Bank             5291.26
1014         4567890123456789   Bank of Maharashtra     4691.12
1015         5678901234567890   Allahabad Bank          5642.73
1016         6789012345678901   Andhra Bank             4469.08
1017         7890123456789012   Canara Bank             5478.81
1018         8901234567890123   Axis Bank               4558.53
1019         9012345678901234   Yes Bank                6130.48
1020         123456789012345    HDFC Bank               5664.28
Name: amount_spend, dtype: float64